Revit 2027 API
BuiltInFailures.RebarFailures.RebarCrankOverEndTreatment Property
 Cannot add crank to the end that already has an end treatment.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RebarCrankOverEndTreatment { get; }
Public Shared ReadOnly Property RebarCrankOverEndTreatment As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RebarCrankOverEndTreatment {
	FailureDefinitionId^ get ();
}
static member RebarCrankOverEndTreatment : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace